{'product_title': 'Complex Analysis: For B.A., B.Sc. Hons. M.A., M.Sc., B.E., PCS, GATE, CSIR-UGC Net and Various Competitive Examination', 'product_image': 'https: //atlanticbooks.com/cdn/shop/files/9788126911356.jpg?v=1740553090', 'product_category': 'Mathematics and Statistics', 'imprint': 'Atlantic', 'publishing_date': 'January 20, 2025', 'pages': '846', 'isbn': '', 'author': 'Hari Kishan', 'variant': 'Pb, Hb', 'price': '747.00', 'book_desc': '<p>Complex Analysis offers a thorough exploration of the concepts and applications of complex analysis. It provides a comprehensive understanding of complex numbers and their geometric representation, along with an in-depth analysis of complex functions, their properties and applications. Across fifteen comprehensive chapters, the book delves into both fundamental and advanced topics, making it a valuable resource for both beginners who are looking to refine their knowledge and aspirants planning to sit for competitive examinations.</p><p><b>Key Features: </b></p><p><ul><li>Each chapter includes numerous solved examples to demonstrate the application of theoretical concepts to practical problems</li><li>Complex ideas are further clarified by illustrative examples that help readers visualise and understand abstract concepts</li><li>Each chapter concludes with a set of exercises, ranging from basic problems to more challenging questions, to facilitate revision of the topics covered</li></ul></p>', 'about_author': 'Hari Kishan is Senior Reader in Mathematics at Kishori Raman Postgraduate College, Mathura, affiliated with Dr. Bhimrao Ambedkar University, Agra and has accumulated over three decades of teaching experience. He completed his MSc from B.S.A. College, Mathura, in 1971 with a record percentage of marks and was awarded a Gold Medal by Agra University. He received his PhD in Mathematics (Fluid Dynamics) in 1981 from the same university. He has published numerous research papers in several reputed mathematical journals and authored multiple books on Mathematics, including Trigonometry, Integral Calculus, Coordinate Geometry of Two Dimensions, Matrices, Modern Algebra, Theory of Equations, Dynamics, Statics, Hydrostatics, Real Analysis, Numerical Analysis and Sure Success in Convergence.', 'toc': 'Preface iii\n1. Complex Numbers and Their Geometrical Representation 1\n2. Limit, Continuity and Differentiability of Complex Functions 99\n3. Analytic Functions 117\n4. Power Series as an Analytic Function 181\n5. Bilinear Transformations 217\n6. Elementary Functions 261\n7. Conformal Transformations 275\n8. Conformal Transformations (Continued) [Some Special Transformations] 327\n9. Complex Integration 391\n10. Taylor and Laurent Series 479\n11. Singularities and Zeroes of an Analytic Function 521\n12. Analytic Continuation 563\n13. Calculus of Residues 591\n14. Augment Principle 795\n15. Integral Functions 801\nIndex  837'}